# Introduction to Pandas

**First the imports**

In [1]:
import warnings; warnings.simplefilter('ignore') # To make life easier
import pandas as pd

** Two major Data Structures Pandas Has:**
* Series
* Data Frame

We shall use Series and Data Frames extensively , therefore many data scientists prefer to include them directly in the name space

In [2]:
from pandas import Series,DataFrame

## Series

A Series is a one-dimensional array-like object containing an array of data (of any
NumPy data type) and an associated array of data labels, called its index

In [3]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

* The default indexs will be assigned like any array index

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj_with_index=Series([1,2,3,4,5,6],index=['a','b','c','d','e','f'])
obj_with_index

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [6]:
obj_with_index.index

Index([u'a', u'b', u'c', u'd', u'e', u'f'], dtype='object')

In [8]:
obj_with_index['a']

1

In [9]:
obj_with_index['d']=44
obj_with_index

a     1
b     2
c     3
d    44
e     5
f     6
dtype: int64

In [10]:
obj_with_index[['c', 'a', 'd']]

c     3
a     1
d    44
dtype: int64

* NumPy array operations, such as filtering with a boolean array, scalar multiplication,or applying math functions, will preserve the index-value link

In [11]:
obj_with_index[obj_with_index > 2]

c     3
d    44
e     5
f     6
dtype: int64

In [12]:
obj_with_index*2

a     2
b     4
c     6
d    88
e    10
f    12
dtype: int64

* One way to think about Series is as a ordered dict , index and value pairs stored in an ordered fashion

In [13]:
'b' in obj_with_index

True

* You can create a Series from a dict too

In [14]:
obj_with_dict=Series({'Maharashtra':1,'Telangana':2,'Kerala':3,'Tamil-Nadu':4,'Karnataka':5})
obj_with_dict

Karnataka      5
Kerala         3
Maharashtra    1
Tamil-Nadu     4
Telangana      2
dtype: int64

* You can also edit the indexes while creating a Series with a Dict

In [15]:
obj_with_dict_ind_changed=Series({'Maharashtra':100,'Telangana':200,'Kerala':300,'Tamil-Nadu':400,'Karnataka':500},index=['Maharashtra','Telangana','Kerala','Tamil-Nadu','Karnataka','Andhra-Pradesh','Orissa','West-Bengal','Uttar-Pradesh'])
obj_with_dict_ind_changed

Maharashtra       100.0
Telangana         200.0
Kerala            300.0
Tamil-Nadu        400.0
Karnataka         500.0
Andhra-Pradesh      NaN
Orissa              NaN
West-Bengal         NaN
Uttar-Pradesh       NaN
dtype: float64

**Note when indexes are given externally the ordered functionality of the series is changed**

## Checking Data For Null Values

**isnull() and notnull() Functions**

In [16]:
pd.isnull(obj_with_dict_ind_changed)

Maharashtra       False
Telangana         False
Kerala            False
Tamil-Nadu        False
Karnataka         False
Andhra-Pradesh     True
Orissa             True
West-Bengal        True
Uttar-Pradesh      True
dtype: bool

In [17]:
pd.notnull(obj_with_dict_ind_changed)

Maharashtra        True
Telangana          True
Kerala             True
Tamil-Nadu         True
Karnataka          True
Andhra-Pradesh    False
Orissa            False
West-Bengal       False
Uttar-Pradesh     False
dtype: bool

In [18]:
obj_with_dict_ind_changed.isnull()

Maharashtra       False
Telangana         False
Kerala            False
Tamil-Nadu        False
Karnataka         False
Andhra-Pradesh     True
Orissa             True
West-Bengal        True
Uttar-Pradesh      True
dtype: bool

* **A critical Series feature for many applications is that it automatically aligns differently indexed data in arithmetic operations**

In [19]:
obj_with_dict

Karnataka      5
Kerala         3
Maharashtra    1
Tamil-Nadu     4
Telangana      2
dtype: int64

In [20]:
obj_with_dict_ind_changed

Maharashtra       100.0
Telangana         200.0
Kerala            300.0
Tamil-Nadu        400.0
Karnataka         500.0
Andhra-Pradesh      NaN
Orissa              NaN
West-Bengal         NaN
Uttar-Pradesh       NaN
dtype: float64

In [21]:
obj_add=obj_with_dict+obj_with_dict_ind_changed
obj_add

Andhra-Pradesh      NaN
Karnataka         505.0
Kerala            303.0
Maharashtra       101.0
Orissa              NaN
Tamil-Nadu        404.0
Telangana         202.0
Uttar-Pradesh       NaN
West-Bengal         NaN
dtype: float64

* **Index values can be edited inplace**

In [22]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [23]:
obj.index=['a','b','c','d']
obj

a    4
b    7
c   -5
d    3
dtype: int64

# Data Frame

## Represents tabular data in an ordered set of columns each can have a different data type

There are numerous ways to construct a DataFrame, though one of the most common
is from a dict of equal-length lists or NumPy arrays

In [24]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002],
'population': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [25]:
frame=DataFrame(data)

In [26]:
frame

   population   state  year
0         1.5    Ohio  2000
1         1.7    Ohio  2001
2         3.6    Ohio  2002
3         2.4  Nevada  2001
4         2.9  Nevada  2002

In [27]:
DataFrame(data, columns=['year', 'state', 'population']) #to change sequence of columns

   year   state  population
0  2000    Ohio         1.5
1  2001    Ohio         1.7
2  2002    Ohio         3.6
3  2001  Nevada         2.4
4  2002  Nevada         2.9

* Accessing Columns

In [28]:
frame['population']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
Name: population, dtype: float64

In [29]:
frame.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object

list down all the columns

In [30]:
frame.columns

Index([u'population', u'state', u'year'], dtype='object')

Assigning a column that doesnâ€™t exist will create a new column. The del keyword will delete columns as with a dict

In [31]:
frame['debt']=200

In [32]:
frame

   population   state  year  debt
0         1.5    Ohio  2000   200
1         1.7    Ohio  2001   200
2         3.6    Ohio  2002   200
3         2.4  Nevada  2001   200
4         2.9  Nevada  2002   200

In [33]:
frame['truth_value']= frame['state']=='Ohio'
frame

   population   state  year  debt  truth_value
0         1.5    Ohio  2000   200         True
1         1.7    Ohio  2001   200         True
2         3.6    Ohio  2002   200         True
3         2.4  Nevada  2001   200        False
4         2.9  Nevada  2002   200        False

In [34]:
del frame['truth_value']
frame

   population   state  year  debt
0         1.5    Ohio  2000   200
1         1.7    Ohio  2001   200
2         3.6    Ohio  2002   200
3         2.4  Nevada  2001   200
4         2.9  Nevada  2002   200

In [35]:
val = Series([-1.2, -1.5, -1.7], index=[2,4,0])
frame['debt'] = val
frame

   population   state  year  debt
0         1.5    Ohio  2000  -1.7
1         1.7    Ohio  2001   NaN
2         3.6    Ohio  2002  -1.2
3         2.4  Nevada  2001   NaN
4         2.9  Nevada  2002  -1.5

* Retreving rows

In [36]:
frame.ix[2]

population     3.6
state         Ohio
year          2002
debt          -1.2
Name: 2, dtype: object

* Transposing the frame

In [37]:
frame.T

               0     1     2       3       4
population   1.5   1.7   3.6     2.4     2.9
state       Ohio  Ohio  Ohio  Nevada  Nevada
year        2000  2001  2002    2001    2002
debt        -1.7   NaN  -1.2     NaN    -1.5

* Accessing values

In [38]:
frame.values

array([[1.5, 'Ohio', 2000L, -1.7],
       [1.7, 'Ohio', 2001L, nan],
       [3.6, 'Ohio', 2002L, -1.2],
       [2.4, 'Nevada', 2001L, nan],
       [2.9, 'Nevada', 2002L, -1.5]], dtype=object)

## Axis in a data frame 
* along rows axis = 0
* along cloumns axis = 1

<img src="pictures/data_frame_axis.JPG">

## Dropping Entries

* The drop function will return a new object with the indicated value or values deleted from an axis, default axis=0
* Can be used for both Series as well as for Data Frame

In [39]:
obj

a    4
b    7
c   -5
d    3
dtype: int64

In [40]:
obj.drop('c')

a    4
b    7
d    3
dtype: int64

In [41]:
frame

   population   state  year  debt
0         1.5    Ohio  2000  -1.7
1         1.7    Ohio  2001   NaN
2         3.6    Ohio  2002  -1.2
3         2.4  Nevada  2001   NaN
4         2.9  Nevada  2002  -1.5

In [42]:
frame.drop(3) # dropping row

   population   state  year  debt
0         1.5    Ohio  2000  -1.7
1         1.7    Ohio  2001   NaN
2         3.6    Ohio  2002  -1.2
4         2.9  Nevada  2002  -1.5

In [43]:
frame.drop('state',axis=1) #dropping column

   population  year  debt
0         1.5  2000  -1.7
1         1.7  2001   NaN
2         3.6  2002  -1.2
3         2.4  2001   NaN
4         2.9  2002  -1.5

In [44]:
frame

   population   state  year  debt
0         1.5    Ohio  2000  -1.7
1         1.7    Ohio  2001   NaN
2         3.6    Ohio  2002  -1.2
3         2.4  Nevada  2001   NaN
4         2.9  Nevada  2002  -1.5

Slicing with labels behaves differently than normal Python slicing in this the endpoint is inclusive

In [45]:
obj

a    4
b    7
c   -5
d    3
dtype: int64

In [46]:
obj['b':'c']

b    7
c   -5
dtype: int64

In [47]:
frame

   population   state  year  debt
0         1.5    Ohio  2000  -1.7
1         1.7    Ohio  2001   NaN
2         3.6    Ohio  2002  -1.2
3         2.4  Nevada  2001   NaN
4         2.9  Nevada  2002  -1.5

In [48]:
frame[1:5]

   population   state  year  debt
1         1.7    Ohio  2001   NaN
2         3.6    Ohio  2002  -1.2
3         2.4  Nevada  2001   NaN
4         2.9  Nevada  2002  -1.5

In [49]:
frame[frame['population'] > 2.5]

   population   state  year  debt
2         3.6    Ohio  2002  -1.2
4         2.9  Nevada  2002  -1.5

In [57]:
frame.population[frame['population'] < 2.5] = 2.5 #changing the values

In [58]:
frame

   population   state  year  debt
0         2.5     2.5  2000  -1.7
1         2.5     2.5  2001   NaN
2         3.6    Ohio  2002  -1.2
3         2.5     2.5  2001   NaN
4         2.9  Nevada  2002  -1.5

### The ix[] function 
* used for selecting subset of rows and columns

In [59]:
frame

   population   state  year  debt
0         2.5     2.5  2000  -1.7
1         2.5     2.5  2001   NaN
2         3.6    Ohio  2002  -1.2
3         2.5     2.5  2001   NaN
4         2.9  Nevada  2002  -1.5

In [60]:
#lets select state,year column with rows 2,3
frame.ix[[2,3],[0,1]] # syntax [list of row indexes, list of column indexes]

   population state
2         3.6  Ohio
3         2.5   2.5

In [61]:
frame.ix[2] #only one parameter selects the row

population     3.6
state         Ohio
year          2002
debt          -1.2
Name: 2, dtype: object

In [62]:
frame.ix[:,2]# selecting only one column

0    2000
1    2001
2    2002
3    2001
4    2002
Name: year, dtype: int64

In [63]:
#boolean operations while selecting 
frame.ix[frame.population>2.5,:]

   population   state  year  debt
2         3.6    Ohio  2002  -1.2
4         2.9  Nevada  2002  -1.5

## Function Mapping

In [64]:
import numpy as np
frame = DataFrame(np.random.randn(4, 3), columns=['b','d','e'],
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [65]:
frame

               b         d         e
Utah    0.290392  1.466965 -1.311031
Ohio    1.729725  0.218757  0.285894
Texas   0.712769  0.348661 -0.005184
Oregon -0.487916 -0.023824  0.639131

In [66]:
#getting into absolute value 
frame=np.abs(frame)
frame

               b         d         e
Utah    0.290392  1.466965  1.311031
Ohio    1.729725  0.218757  0.285894
Texas   0.712769  0.348661  0.005184
Oregon  0.487916  0.023824  0.639131

In [67]:
f = lambda x: x.max() - x.min()

**Applying the function is done using apply()**

In [68]:
frame.apply(f) # applying function accross columns

b    1.439333
d    1.443141
e    1.305847
dtype: float64

In [69]:
frame.apply(f,axis=1)

Utah      1.176573
Ohio      1.510968
Texas     0.707585
Oregon    0.615307
dtype: float64

In [70]:
f1 = lambda x: x+1 
frame.b.apply(f1)

Utah      1.290392
Ohio      2.729725
Texas     1.712769
Oregon    1.487916
Name: b, dtype: float64

## Sorting

In [ ]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])

In [71]:
frame

               b         d         e
Utah    0.290392  1.466965  1.311031
Ohio    1.729725  0.218757  0.285894
Texas   0.712769  0.348661  0.005184
Oregon  0.487916  0.023824  0.639131

In [72]:
frame.sort_index()

               b         d         e
Ohio    1.729725  0.218757  0.285894
Oregon  0.487916  0.023824  0.639131
Texas   0.712769  0.348661  0.005184
Utah    0.290392  1.466965  1.311031

In [73]:
frame.sort_index(axis=1)

               b         d         e
Utah    0.290392  1.466965  1.311031
Ohio    1.729725  0.218757  0.285894
Texas   0.712769  0.348661  0.005184
Oregon  0.487916  0.023824  0.639131

In [74]:
# descending sort 
frame.sort_index(axis=1,ascending=False)

               e         d         b
Utah    1.311031  1.466965  0.290392
Ohio    0.285894  0.218757  1.729725
Texas   0.005184  0.348661  0.712769
Oregon  0.639131  0.023824  0.487916

#### Sorting by one or more columns

In [75]:
frame

               b         d         e
Utah    0.290392  1.466965  1.311031
Ohio    1.729725  0.218757  0.285894
Texas   0.712769  0.348661  0.005184
Oregon  0.487916  0.023824  0.639131

In [76]:
frame.sort_index(by=['a','b'])

KeyError: 'a'

In [77]:
frame.sort_index(by='a')

KeyError: 'a'

For a series object use order method

In [ ]:
obj

In [ ]:
obj.order()

In [78]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [79]:
df.sum() #summing along columns

one    9.25
two   -5.80
dtype: float64

In [80]:
df.sum(axis=1) #summing along columns

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [81]:
df.mean(axis=1, skipna=False) #finding mean without ignoring Null value

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [82]:
df.mean(axis=1, skipna=True)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [83]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

**we shall see another function describe when we see loading of data from files**

## Handling Missing Data

### Detecting Missing Values

**We already discussed about functions like isnull(), notnull()**

### Filtering out Missing Values

In [84]:
from numpy import nan as NA # as in this section we will be using a lot of np.nan value 
data = Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [85]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [86]:
data.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [87]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [88]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])

In [89]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [90]:
clean_data=data.dropna()

In [91]:
clean_data

     0    1    2
0  1.0  6.5  3.0

* Passing how='all' will only drop rows that are all NA

In [92]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [93]:
data.dropna(axis=1, how='all') #since no column is completely null nothing removed

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

### Filling out missing Data

In [94]:
data = DataFrame(np.random.randn(7, 3))
data.ix[:4, 1] = NA; data.ix[:2, 2] = NA # rows 0:4 & column 1 = NaN and rows 0:2 and column 2 = NaN
data

          0         1         2
0  0.947482       NaN       NaN
1  0.747912       NaN       NaN
2  1.697349       NaN       NaN
3  0.070749       NaN  0.168081
4  0.556005       NaN  0.037296
5  0.542345 -0.649971 -1.854562
6 -0.686485 -0.053819  0.276234

Fill Missing values with 0

In [95]:
data.fillna(0)

          0         1         2
0  0.947482  0.000000  0.000000
1  0.747912  0.000000  0.000000
2  1.697349  0.000000  0.000000
3  0.070749  0.000000  0.168081
4  0.556005  0.000000  0.037296
5  0.542345 -0.649971 -1.854562
6 -0.686485 -0.053819  0.276234

Calling fillna with a dict you can use a different fill value for each column

In [96]:
data.fillna({1: 0.5, 3: -1})

          0         1         2
0  0.947482  0.500000       NaN
1  0.747912  0.500000       NaN
2  1.697349  0.500000       NaN
3  0.070749  0.500000  0.168081
4  0.556005  0.500000  0.037296
5  0.542345 -0.649971 -1.854562
6 -0.686485 -0.053819  0.276234

The filling can be inplace too

In [97]:
data

          0         1         2
0  0.947482       NaN       NaN
1  0.747912       NaN       NaN
2  1.697349       NaN       NaN
3  0.070749       NaN  0.168081
4  0.556005       NaN  0.037296
5  0.542345 -0.649971 -1.854562
6 -0.686485 -0.053819  0.276234

In [98]:
data.fillna(0,inplace=True)

In [100]:
data

          0         1         2
0  0.947482  0.000000  0.000000
1  0.747912  0.000000  0.000000
2  1.697349  0.000000  0.000000
3  0.070749  0.000000  0.168081
4  0.556005  0.000000  0.037296
5  0.542345 -0.649971 -1.854562
6 -0.686485 -0.053819  0.276234

Filling by mean

In [101]:
data = DataFrame(np.random.randn(7, 3))
data.ix[:4, 1] = NA; data.ix[:2, 2] = NA # rows 0:4 & column 1 = NaN and rows 0:2 and column 2 = NaN
data

          0         1         2
0 -0.449293       NaN       NaN
1 -0.405554       NaN       NaN
2  0.877490       NaN       NaN
3  1.862195       NaN -0.261265
4 -0.812743       NaN -1.989560
5  1.968199  0.792944 -0.865748
6 -1.915907 -1.701165  1.552398

In [102]:
data.fillna(data.mean(),inplace=True)

          0         1         2
0 -0.449293 -0.454111 -0.391044
1 -0.405554 -0.454111 -0.391044
2  0.877490 -0.454111 -0.391044
3  1.862195 -0.454111 -0.261265
4 -0.812743 -0.454111 -1.989560
5  1.968199  0.792944 -0.865748
6 -1.915907 -1.701165  1.552398

## Data Loading

<img src="pictures/data_reading.JPG">

In [103]:
df = pd.read_csv('data sets/ex1.csv')

In [104]:
pd.read_table('data sets/ex1.csv',sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [105]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [111]:
# df['message_len']=len(df.message)
# df
length=lambda x:len(x)
df['message-len']=df.message.apply(length)
df

   a   b   c   d message  message_len  message-len
0  1   2   3   4   hello            3            5
1  1   6   7   8   world            3            5
2  9  10  11  12     foo            3            3

### Writing to files

In [112]:
df.to_csv('our_data.csv')

In [113]:
df['a'][1]=1

In [114]:
df

   a   b   c   d message  message_len  message-len
0  1   2   3   4   hello            3            5
1  1   6   7   8   world            3            5
2  9  10  11  12     foo            3            3

### Unique Values, Value Counts, and Membership

In [115]:
df.a.unique()

array([1, 9], dtype=int64)

In [116]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [117]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [118]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [119]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [120]:
pd.value_counts(obj.values, sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [121]:
pd.value_counts(obj.values, sort=True)

c    3
a    3
b    2
d    1
dtype: int64

In [122]:
mask = obj.isin(['b', 'c']) #if the value is there then it returns true or else false

In [123]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [124]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

### Apart from the discussed functionalities in pandas there are a lot more ... feel free to try it out